# PagesCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplayingOptionsDialogEventArgs..::..PagesCount Property
DisplayingOptionsDialogEventArgs Class See Also
---
The count of pages in the options dialog (include the default pages added by Revit).
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int PagesCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PagesCount As Integer
	Get
```

Visual C++
---
```text
public:
property int PagesCount {
	int get ();
}
```

# See Also
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace